#+TITLE: test service
#+AUTHOR: GTrunSec
#+EMAIL: gtrunsec@hardenedlinux.org
#+DATE:  4 April 2020
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en cn
#+OPTIONS: H:3 num:t toc:t \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
* Run all of services
#+begin_src sh :exports both :results output
systemctl --user start apache-kafka.service
systemctl --user start kibana.service
systemctl --user start elasticsearch-7x.service
systemctl --user start zookeeper.service
systemctl --user start zookeeper.service
systemctl --user start logstash.service
systemctl --user start netdata.service
#+end_src

#+RESULTS:
 
* Netdata
#+begin_src sh :async t :exports both :results output
systemctl --user status netdata.service
#+end_src

* Kafka & Zookeeper
** KAfka
#+begin_src sh :exports both :results output
systemctl --user start apache-kafka.service
#+end_src

#+RESULTS:

#+begin_src sh :async t :exports both :results output
systemctl --user status apache-kafka.service
#+end_src

#+RESULTS:
: ● apache-kafka.service
:    Loaded: loaded (/nix/store/2kqpqnq3af8gilasnhcxsrxap1230mkr-apache-kafka.service/apache-kafka.service; linked; vendor preset: enabled)
:    Active: active (running) since Wed 2020-06-17 09:52:47 HKT; 20s ago
:  Main PID: 32257 (bash)
:    CGroup: /user.slice/user-1000.slice/user@1000.service/apache-kafka.service
:            ├─32257 /nix/store/n313xks5ym0s0a5v8a5285rmnmvy6ms9-bash-4.4-p23/bin/bash /nix/store/48p5hznfyvxcnhpng3lrng95fbf28l6v-run-kafka
:            └─32259 /nix/store/j03rf32h0a71cqr48nqs9i19gv0hz444-openjdk-8u242-b08-jre/bin/java -cp /nix/store/zfnncgaj0slc1m50gpngy5pqv9djav6a-apache-kafka-2.12-2.4.0/libs/* -Dlog4j.configuration=file:/nix/store/xyn24fbkziw69cqbrzaim18gjc1c0fsh-log4j.properties -server -Xmx1G -Xms1G -XX:+UseCompressedOops -XX:+UseParNewGC -XX:+UseConcMarkSweepGC -XX:+CMSClassUnloadingEnabled -XX:+CMSScavengeBeforeRemark -XX:+DisableExplicitGC -Djava.awt.headless=true -Djava.net.preferIPv4Stack=true kafka.Kafka /nix/store/b585aypwj5x9q6dazb43i5fnqzxsrryl-server.properties
** Zookeeper
#+begin_src sh :async t :exports both :results output
systemctl --user start  zookeeper.service
#+end_src

#+RESULTS:

#+begin_src sh :async t :exports both :results output
systemctl --user status zookeeper.service
#+end_src

#+RESULTS:
: ● zookeeper.service
:    Loaded: loaded (/nix/store/23lf50r0xxg5hf9apkry60ccjxxpiz6n-zookeeper.service/zookeeper.service; linked; vendor preset: enabled)
:    Active: active (running) since Wed 2020-06-17 09:52:28 HKT; 31s ago
:   Process: 31806 ExecStartPre=/usr/bin/echo 0 > /var/lib/zookeeper/myid (code=exited, status=0/SUCCESS)
:  Main PID: 31807 (bash)
:    CGroup: /user.slice/user-1000.slice/user@1000.service/zookeeper.service
:            ├─31807 /nix/store/n313xks5ym0s0a5v8a5285rmnmvy6ms9-bash-4.4-p23/bin/bash /nix/store/8lxdygjyd0rpy289cv5543j7y8r8q70f-run-zookeeper
:            └─31809 /nix/store/j03rf32h0a71cqr48nqs9i19gv0hz444-openjdk-8u242-b08-jre/bin/java -cp /nix/store/3753aissfijlblcngb9i0bw1v0f15kpb-zookeeper-3.4.13/lib/*:/nix/store/3753aissfijlblcngb9i0bw1v0f15kpb-zookeeper-3.4.13/zookeeper-3.4.13.jar:/nix/store/8hlksrmj542hxr1y9f95ax5m1hy6x24n-zookeeper-conf -Dcom.sun.management.jmxremote -Dcom.sun.management.jmxremote.local.only=true -Dzookeeper.datadir.autocreate=false -Djava.net.preferIPv4Stack=true org.apache.zookeeper.server.quorum.QuorumPeerMain /nix/store/8hlksrmj542hxr1y9f95ax5m1hy6x24n-zookeeper-conf/zoo.cfg

* Elastic
** Elastic 5x
#+begin_src sh :async t :exports both :results output
systemctl --user status elasticsearch.service
#+end_src

#+RESULTS:
: ● elasticsearch.service
:    Loaded: loaded (/nix/store/kbf8nmpp9zh9c9mhadj8dwajwb3qicwc-elasticsearch.service/elasticsearch.service; linked; vendor preset: enabled)
:    Active: active (running) since Thu 2020-04-02 12:24:46 HKT; 1 day 17h ago
:  Main PID: 24830 (java)
:    CGroup: /user.slice/user-1001.slice/user@1001.service/elasticsearch.service
:            ├─24830 /nix/store/8wmf6apz3yss4vz67z6xdwhhd08yz4cb-openjdk-headless-8u222-ga-jre/bin/java -Xms1g -Xmx1g -XX:+UseConcMarkSweepGC -XX:CMSInitiatingOccupancyFraction=75 -XX:+UseCMSInitiatingOccupancyOnly -Des.networkaddress.cache.ttl=60 -Des.networkaddress.cache.negative.ttl=10 -XX:+AlwaysPreTouch -Xss1m -Djava.awt.headless=true -Dfile.encoding=UTF-8 -Djna.nosys=true -XX:-OmitStackTraceInFastThrow -Dio.netty.noUnsafe=true -Dio.netty.noKeySetOptimization=true -Dio.netty.recycler.maxCapacityPerThread=0 -Dlog4j.shutdownHookEnabled=false -Dlog4j2.disable.jmx=true -Djava.io.tmpdir=/tmp/elasticsearch-2352954014746958930 -XX:+HeapDumpOnOutOfMemoryError -XX:HeapDumpPath=data -XX:ErrorFile=logs/hs_err_pid%p.log -XX:+PrintGCDetails -XX:+PrintGCDateStamps -XX:+PrintTenuringDistribution -XX:+PrintGCApplicationStoppedTime -Xloggc:logs/gc.log -XX:+UseGCLogFileRotation -XX:NumberOfGCLogFiles=32 -XX:GCLogFileSize=64m -Des.path.home=/var/lib/elasticsearch -Des.path.conf=/var/lib/elasticsearch/config -Des.distribution.flavor=default -Des.distribution.type=tar -cp /nix/store/6czj00nnxdzr18by4n3rqlfcp0csak0b-elasticsearch-6.8.3/lib/* org.elasticsearch.bootstrap.Elasticsearch
:            └─25013 /var/lib/elasticsearch/modules/x-pack-ml/platform/linux-x86_64/bin/controller
** Elastci 7x
#+begin_src sh :async t :exports both :results output
systemctl --user start elasticsearch-7x.service
#+end_src

#+begin_src sh :async t :exports both :results output
systemctl --user status elasticsearch-7x.service
#+end_src

#+RESULTS:
: ● elasticsearch-7x.service
:    Loaded: loaded (/nix/store/kfbqapfjvm8hrrkr76h4vlldf07yl7iy-elasticsearch-7x.service/elasticsearch-7x.service; linked; vendor preset: enabled)
:    Active: active (running) since Wed 2020-06-17 08:19:33 HKT; 11s ago
:   Process: 31128 ExecStartPre=/nix/store/n313xks5ym0s0a5v8a5285rmnmvy6ms9-bash-4.4-p23/bin/bash -c rm -rf /var/lib/elasticsearch/7/config; ln -sfT /nix/store/2zpiq4yv9smdn0r27l9vlghrkrish8f8-elasticsearch-plugins/plugins /var/lib/elasticsearch/7/plugins; ln -sfT /nix/store/qzpyij890s7s03cabgx28fvfsydb9j28-elasticsearch-7.5.1/lib /var/lib/elasticsearch/7/lib; ln -sfT /nix/store/qzpyij890s7s03cabgx28fvfsydb9j28-elasticsearch-7.5.1/modules /var/lib/elasticsearch/7/modules; mkdir -p /var/lib/elasticsearch/7/config; cp /nix/store/n5hv7pr2a1rdmfi8qyzc07915cqprc9n-elasticsearch.yml /var/lib/elasticsearch/7/config/elasticsearch.yml; rm -f /var/lib/elasticsearch/7/config/logging.yml; cp /nix/store/x00hv3aq569y38qgpyyj39gnqf9vgh06-log4j2.properties /var/lib/elasticsearch/7/config/log4j2.properties; cp /nix/store/qzpyij890s7s03cabgx28fvfsydb9j28-elasticsearch-7.5.1/config/jvm.options /var/lib/elasticsearch/7/config/jvm.options (code=exited, status=0/SUCCESS)
:  Main PID: 31138 (java)
:    CGroup: /user.slice/user-1000.slice/user@1000.service/elasticsearch-7x.service
:            ├─31138 /nix/store/1g5nz9lk6q1msv50wcg5n0yg0f8f322h-openjdk-headless-8u242-b08-jre/bin/java -Des.networkaddress.cache.ttl=60 -Des.networkaddress.cache.negative.ttl=10 -XX:+AlwaysPreTouch -Xss1m -Djava.awt.headless=true -Dfile.encoding=UTF-8 -Djna.nosys=true -XX:-OmitStackTraceInFastThrow -Dio.netty.noUnsafe=true -Dio.netty.noKeySetOptimization=true -Dio.netty.recycler.maxCapacityPerThread=0 -Dio.netty.allocator.numDirectArenas=0 -Dlog4j.shutdownHookEnabled=false -Dlog4j2.disable.jmx=true -Djava.locale.providers=COMPAT -Xms1g -Xmx1g -XX:+UseConcMarkSweepGC -XX:CMSInitiatingOccupancyFraction=75 -XX:+UseCMSInitiatingOccupancyOnly -Djava.io.tmpdir=/tmp/elasticsearch-4751691899349924076 -XX:+HeapDumpOnOutOfMemoryError -XX:HeapDumpPath=data -XX:ErrorFile=logs/hs_err_pid%p.log -XX:+PrintGCDetails -XX:+PrintGCDateStamps -XX:+PrintTenuringDistribution -XX:+PrintGCApplicationStoppedTime -Xloggc:logs/gc.log -XX:+UseGCLogFileRotation -XX:NumberOfGCLogFiles=32 -XX:GCLogFileSize=64m -XX:MaxDirectMemorySize=536870912 -Des.path.home=/var/lib/elasticsearch/7 -Des.path.conf=/var/lib/elasticsearch/7/config -Des.distribution.flavor=default -Des.distribution.type=tar -Des.bundled_jdk=true -cp /nix/store/qzpyij890s7s03cabgx28fvfsydb9j28-elasticsearch-7.5.1/lib/* org.elasticsearch.bootstrap.Elasticsearch
:            └─31489 /var/lib/elasticsearch/7/modules/x-pack-ml/platform/linux-x86_64/bin/controller

* Kibana
#+begin_src sh :async t :exports both :results output
systemctl --user start kibana.service
#+end_src

#+begin_src sh :async t :exports both :results output
systemctl --user status kibana.service
#+end_src

#+RESULTS:
: ● kibana.service
:    Loaded: loaded (/nix/store/74gy91xyqr1ph101cpgvxsc4pmga40ff-kibana.service/kibana.service; linked; vendor preset: enabled)
:    Active: active (running) since Wed 2020-06-17 08:20:07 HKT; 4s ago
:  Main PID: 31637 (bash)
:    CGroup: /user.slice/user-1000.slice/user@1000.service/kibana.service
:            ├─31637 /nix/store/n313xks5ym0s0a5v8a5285rmnmvy6ms9-bash-4.4-p23/bin/bash /nix/store/igvhqxsd9nqvpy5y8hifmshqkpny3fgy-run-kibana
:            └─31639 /nix/store/zjza9ffirh3pfcfpfslq3hm5mm8kzq5w-nodejs-10.21.0/bin/node /nix/store/ziq9bp33dca7r5mbg3vh75y9ljwlicm5-kibana-7.5.1/libexec/kibana/bin/../src/cli --config /nix/store/bla8sniwwa5gk7qz0bdcwjfnc3pzz4px-kibana.json --path.data /var/lib/kibana

* Hydra
** Hydra-server
#+begin_src sh :async t :exports both :results output
systemctl --user restart hydra-server.service
#+end_src

#+begin_src sh :async t :exports both :results output
systemctl --user status hydra-server.service
#+end_src

#+RESULTS:
#+begin_example
● hydra-server.service
   Loaded: loaded (/nix/store/zgiqb9c9hfhz64flmk5vskvhhsdaw19r-hydra-server.service/hydra-server.service; linked; vendor preset: enabled)
   Active: active (running) since Fri 2020-04-03 10:40:41 HKT; 19h ago
 Main PID: 8216 (starman master )
   CGroup: /user.slice/user-1001.slice/user@1001.service/hydra-server.service
           ├─ 3807 starman worker
           ├─ 8216 starman master
           ├─20670 starman worker
           ├─22010 starman worker
           ├─22031 starman worker
           └─27929 starman worker
#+end_example

** Hydra-queue-runner
#+begin_src sh :async t :exports both :results output
systemctl --user restart hydra-queue-runner.service
#+end_src

#+begin_src sh :async t :exports both :results output
systemctl --user status hydra-queue-runner.service
#+end_src

#+RESULTS:
: ● hydra-queue-runner.service
:    Loaded: loaded (/nix/store/4yxchssh61v8dvj80dvr56wkmxyqggkn-hydra-queue-runner.service/hydra-queue-runner.service; linked; vendor preset: enabled)
:    Active: active (running) since Sat 2020-04-04 03:57:44 HKT; 1h 48min ago
:  Main PID: 30897 (hydra-queue-run)
:    CGroup: /user.slice/user-1001.slice/user@1001.service/hydra-queue-runner.service
:            ├─ 9757 nix-store --serve --write
:            └─30897 /nix/store/zj34mhylqnm7h32jylqy4msw2c5bvr6v-hydra-2020-02-06/bin/hydra-queue-runner -vvvv

**  Hydra-evaluator
#+begin_src sh :async t :exports both :results output
systemctl --user restart hydra-evaluator.service
#+end_src

#+begin_src sh :async t :exports both :results output
systemctl --user status hydra-evaluator.service
#+end_src

#+RESULTS:
: ● hydra-evaluator.service
:    Loaded: loaded (/nix/store/3n57wmq2ldlm935jnf2kv61xj3swv3q6-hydra-evaluator.service/hydra-evaluator.service; linked; vendor preset: enabled)
:    Active: active (running) since Sat 2020-04-04 04:41:45 HKT; 1h 2min ago
:  Main PID: 16088 (hydra-evaluator)
:    CGroup: /user.slice/user-1001.slice/user@1001.service/hydra-evaluator.service
:            └─16088 hydra-evaluator
* Osquery
#+begin_src sh :async t :exports both :results output
systemctl --user restart osquery.service
#+end_src

#+begin_src sh :async t :exports both :results output
systemctl --user status osquery.service
#+end_src

#+RESULTS:
: ● osquery.service
:    Loaded: loaded (/nix/store/3ashimzj1xxxcv6pxc9rsg63bj162gkg-osquery.service/osquery.service; linked; vendor preset: enabled)
:    Active: active (running) since Sat 2020-04-04 05:50:03 HKT; 2s ago
:  Main PID: 9751 (osqueryd)
:    CGroup: /user.slice/user-1001.slice/user@1001.service/osquery.service
:            └─9751 /nix/store/259v1w7rcsdqlbkb8n3vjig2iy1myim9-osquery-4.2.0/bin/osqueryd --database_path /var/osquery/osquery.db --logger_path /var/osquery/log --pidfile /var/osquery/osqueryd.pidfile --database_path /var/osquery/osquery.db --extensions_socket /var/osquery/osquery.em --config_path /home/nsm//.osquery/osquery.conf

* Nix
** nix-serve
#+begin_src sh :async t :exports both :results output
systemctl --user status nix-serve.service
#+end_src

#+RESULTS:
#+begin_example
● nix-serve.service
   Loaded: loaded (/nix/store/bnd7wwnp99h2pp1agqv4v2hip73jbwx7-nix-serve.service/nix-serve.service; linked; vendor preset: enabled)
   Active: active (running) since Sun 2020-05-31 16:01:05 HKT; 6s ago
 Main PID: 3188 (starman master )
   CGroup: /user.slice/user-1000.slice/user@1000.service/nix-serve.service
           ├─3188 starman master /nix/store/6sqmqjabn0cmn67jq8h47z69xlv9nk39-nix-serve-0.2-e4675e3/libexec/nix-serve/nix-serve.psgi --listen 0.0.0.0:8001
           ├─3191 starman worker /nix/store/6sqmqjabn0cmn67jq8h47z69xlv9nk39-nix-serve-0.2-e4675e3/libexec/nix-serve/nix-serve.psgi --listen 0.0.0.0:8001
           ├─3192 starman worker /nix/store/6sqmqjabn0cmn67jq8h47z69xlv9nk39-nix-serve-0.2-e4675e3/libexec/nix-serve/nix-serve.psgi --listen 0.0.0.0:8001
           ├─3193 starman worker /nix/store/6sqmqjabn0cmn67jq8h47z69xlv9nk39-nix-serve-0.2-e4675e3/libexec/nix-serve/nix-serve.psgi --listen 0.0.0.0:8001
           ├─3194 starman worker /nix/store/6sqmqjabn0cmn67jq8h47z69xlv9nk39-nix-serve-0.2-e4675e3/libexec/nix-serve/nix-serve.psgi --listen 0.0.0.0:8001
           └─3195 starman worker /nix/store/6sqmqjabn0cmn67jq8h47z69xlv9nk39-nix-serve-0.2-e4675e3/libexec/nix-serve/nix-serve.psgi --listen 0.0.0.0:8001
#+end_example
-key

#+begin_src sh :async t :exports both :results output
mkdir ~/.config/key
cd ~/.config/key
nix-store --generate-binary-cache-key http://221.4.35.244:8301 cache-priv-key.pem cache-pub-key.pem
#+end_src

* PostgreSQL
#+begin_src sh :async t :exports both :results output
systemctl --user status postgresql.service
#+end_src

#+RESULTS:
#+begin_example
● postgresql.service
   Loaded: loaded (/nix/store/941lrx9pggxmsv88b2cagdj27vlcv1bn-postgresql.service/postgresql.service; linked; vendor preset: enabled)
   Active: active (running) since Fri 2020-04-03 09:12:25 HKT; 20h ago
 Main PID: 10141 (bash)
   CGroup: /user.slice/user-1001.slice/user@1001.service/postgresql.service
           ├─ 4005 postgres: nsm hydra [local] idle
           ├─ 7660 postgres: hydra hydra ::1(50702) idle
           ├─ 8300 postgres: hydra hydra ::1(50488) idle
           ├─10141 /nix/store/9si14qjcz8072c0v42zbkglq08s2cg04-bash-4.4-p23/bin/bash /nix/store/glcg74jsvlpq88r85j3kb49a54npmyqk-run-postgresql
           ├─10148 /nix/store/kxy8qfbm8vl3kl3lbkvq09y16mvzk4nc-postgresql-11.7/bin/postgres -k /run/postgresql/
           ├─10164 postgres: checkpointer
           ├─10165 postgres: background writer
           ├─10166 postgres: walwriter
           ├─10167 postgres: autovacuum launcher
           ├─10168 postgres: stats collector
           ├─10169 postgres: logical replication launcher
           ├─16109 postgres: hydra hydra ::1(50386) idle
           ├─16118 postgres: hydra hydra ::1(50388) idle
           ├─21969 postgres: hydra hydra ::1(50650) idle
           ├─29319 postgres: hydra hydra ::1(50172) idle
           ├─30919 postgres: nsm hydra [local] idle
           └─30925 postgres: nsm hydra [local] idle
#+end_example
* Vast
#+begin_src sh :async t :exports both :results output
systemctl --user start osquery.service
#+end_src

#+begin_src sh :async t :exports both :results output
systemctl --user status vast.service
#+end_src

#+RESULTS:
: ● vast.service
:    Loaded: loaded (/nix/store/lgs8400az7ckwl7wb5qr9hdj3pzqq804-vast.service/vast.service; linked; vendor preset: enabled)
:    Active: active (running) since Sat 2020-04-04 05:51:42 HKT; 10s ago
:  Main PID: 3367 (vast)
:    CGroup: /user.slice/user-1001.slice/user@1001.service/vast.service
:            └─3367 /nix/store/n6vm1zifpl65445k6w866sf109j2imwm-vast/bin/vast -c /nix/store/zkmj2wbi3ahx4ldj9jzxznabnhg3d678-vast.conf start
